

INSERT INTO users (
    username,
    email,
    password_hash,
    goal,
    auth_provider -- 1, Admin 2, local
) VALUES 
    -- guest_password
    ('ゲストユーザ', 'guest@example.com', '$2a$10$QRgyY2p3u9GyKyRE0VtQUeLmlfzOlRUCburHp8idAHobYBdqSvtZm', 'test goal', 1),
    -- chief_password
    ('チーフユーザ', 'chief@example.com', '$2a$10$6pfWMd.kdOXB2tuVnnavo.qctC2hzZ5o.tRPe8lEDYqmAtWuXb.eO', 'second goal', 2);

INSERT INTO records (
    trained_part, -- 1, 体感 2,背骨 3,顔 4,首 5,背中 6,お腹 7,肩 8,二の腕 9,腕（ひじ下） 10,手 11,おしり 12,太もも 13,内もも 14,ふくらはぎ 15,足
    workout_duration,
    workout_date,
    user_id
) VALUES 
    (1, 30, '2025-11-30', 1),
    (2, 20, '2025-11-30', 1),
    (3, 15, '2025-11-30', 1),
    (4, 10, '2025-11-30', 1),
    (5, 25, '2025-11-30', 1),
    (6, 30, '2025-11-30', 1),
    (7, 20, '2025-11-30', 1),
    (8, 15, '2025-11-30', 1),
    (9, 10, '2025-12-30', 1),
    (10, 5, '2025-12-30', 1),
    (11, 20, '2025-12-30', 1),
    (12, 25, '2025-12-30', 1),
    (13, 15, '2025-12-30', 1),
    (14, 10, '2025-12-30', 1),
    (15, 5, '2025-12-30', 1),
    (1, 25, '2026-01-13', 1),
    (2, 30, '2026-01-14', 1),
    (3, 20, '2026-01-14', 1),
    (10, 15, '2026-01-15', 1),
    (5, 10, '2026-01-15', 1),
    (6, 5, '2026-01-15', 1),
    (7, 30, '2026-01-17', 1),
    (8, 25, '2026-01-17', 1),
    (1, 20, '2026-01-17', 1),
    (10, 15, '2026-01-20', 1),
    (11, 10, '2026-01-20', 1),
    (12, 5, '2026-01-20', 1),
    (12, 30, '2026-01-22', 1),
    (12, 25, '2026-01-22', 1),
    (15, 20, '2026-01-22', 1);






