

INSERT INTO users (
    username,
    email,
    password_hash,
    comment,
    auth_provider
) VALUES 
    -- hashed_password
    ('testuser', 'test@example.com', '$2a$10$MjnhSuHCB.hnTJoqGY0IRu7OM30SVofw1l2rxCFOCQJeL5V8E58Xy', 'test comment', 'Admin'),
    ('seconduser', 'second@example.com', '$2a$10$e0MYzXyjpJS7Pd0RVvHwHeFX5J8vYh3U8b8r7bq4p6d8Z6pG6FhHy', 'second comment', 'local');
-- const list = [
--   "体感","背骨", "顔","首","背中","お腹","肩","二の腕","腕（ひじ下）",
--    "手","おしり","太もも","内もも","ふくらはぎ","足",
-- ];
INSERT INTO records (
    gaman_thing, 
    gaman_minutes,
    gaman_day,
    user_id
) VALUES 
    ('体感', 30, '2025-11-30', 1),
    ('背骨', 20, '2025-11-30', 1),
    ('顔', 15, '2025-11-30', 1),
    ('首', 10, '2025-11-30', 1),
    ('背中', 25, '2025-11-30', 1),
    ('お腹', 30, '2025-11-30', 1),
    ('肩', 20, '2025-11-30', 1),
    ('二の腕', 15, '2025-11-30', 1),
    ('腕（ひじ下）', 10, '2025-11-30', 1),
    ('手', 5, '2025-11-30', 1),
    ('おしり', 20, '2025-11-30', 1),
    ('太もも', 25, '2025-11-30', 1),
    ('内もも', 15, '2025-11-30', 1),
    ('ふくらはぎ', 10, '2025-11-30', 1),
    ('足', 5, '2025-11-30', 1),
    ('体感', 40, '2025-12-01', 2),
    ('背中', 30, '2025-12-01', 2),
    ('肩', 25, '2025-12-01', 2),
    ('お腹', 35, '2025-12-01', 2),
    ('首', 25, '2025-12-01', 2),
    ('顔', 20, '2025-12-02', 2),
    ('二の腕', 20, '2025-12-02', 2),
    ('腕（ひじ下）', 25, '2025-12-02', 2),
    ('手', 5, '2025-12-02', 2),
    ('背骨', 25, '2025-12-02', 2),
    ('太もも', 30, '2025-12-03', 2),
    ('内もも', 20, '2025-12-03', 2),
    ('おしり', 25, '2025-12-03', 2),
    ('ふくらはぎ', 25, '2025-12-03', 2),
    ('足', 20, '2025-12-03', 2);

