

INSERT INTO users (
    username,
    email,
    password_hash,
    comment,
    auth_provider -- 1, Admin 2, local
) VALUES 
    -- hashed_password
    ('testuser', 'test@example.com', '$2a$10$MjnhSuHCB.hnTJoqGY0IRu7OM30SVofw1l2rxCFOCQJeL5V8E58Xy', 'test comment', 1),
    ('seconduser', 'second@example.com', '$2a$10$e0MYzXyjpJS7Pd0RVvHwHeFX5J8vYh3U8b8r7bq4p6d8Z6pG6FhHy', 'second comment', 2);
-- const list = [
--   "体感","背骨", "顔","首","背中","お腹","肩","二の腕","腕（ひじ下）",
--    "手","おしり","太もも","内もも","ふくらはぎ","足",
-- ];
INSERT INTO records (
    trained_part, -- 1, 体感 2,背骨 3,顔 4,首 5,背中 6,お腹 7,肩 8,二の腕 9,腕（ひじ下） 10,手 11,おしり 12,太もも 13,内もも 14,ふくらはぎ 15,足
    workout_duration,
    workout_date,
    user_id
) VALUES 
    (1, 30, '2025-11-30', 1),
    (2, 20, '2025-11-30', 1),
    (3, 15, '2025-11-30', 1),
    (4, 10, '2025-11-30', 1),
    (5, 25, '2025-11-30', 1),
    (6, 30, '2025-11-30', 1),
    (7, 20, '2025-11-30', 1),
    (8, 15, '2025-11-30', 1),
    (9, 10, '2025-11-30', 1),
    (10, 5, '2025-11-30', 1),
    (11, 20, '2025-11-30', 1),
    (12, 25, '2025-11-30', 1),
    (13, 15, '2025-11-30', 1),
    (14, 10, '2025-11-30', 1),
    (15, 5, '2025-11-30', 1),
    (1, 40, '2025-12-01', 2),
    (5, 30, '2025-12-01', 2),
    (7, 25, '2025-12-01', 2),
    (6, 35, '2025-12-01', 2),
    (4, 25, '2025-12-01', 2),
    (3, 20, '2025-12-02', 2),
    (8, 20, '2025-12-02', 2),
    (9, 25, '2025-12-02', 2),
    (10, 5, '2025-12-02', 2),
    (2, 25, '2025-12-02', 2),
    (12, 30, '2025-12-03', 2),
    (13, 20, '2025-12-03', 2),
    (11, 25, '2025-12-03', 2),
    (14, 25, '2025-12-03', 2),
    (15, 20, '2025-12-03', 2);

INSERT INTO goals (
    user_id,
    goal,
    created_at
) VALUES 
    (1, '毎日ストレッチを続ける', '2025-11-01T10:00:00+09:00'),
    (1, '週に3回は運動する', '2025-11-10T10:00:00+09:00'),
    (2, '体重を5kg減らす', '2025-12-31T10:00:00+09:00'),
    (2, '毎朝10分間の瞑想を行う', '2025-01-11T10:00:00+09:00');



